In [1]:
!python --version

Python 3.10.8

In [12]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

In [11]:
ds = pd.read_csv('ecommerce_dataset.csv')
ds.head(6)

,transaction_id,store,customer_id,customer_city,customer_gender,product_id,product_price,quantity,total,created_at
0,169483,Ofline store,300726,Jakarta,Male,34,1088,64,69632,2018-07-06 18:02:28.000000 UTC
1,262286,Ofline store,186646,Tangerang,Male,34,1088,64,69632,2018-08-27 17:07:31.000000 UTC
2,338083,Ofline store,257168,Depok,Female,34,1088,64,69632,2018-09-28 14:50:06.000000 UTC
3,311059,Ofline store,190587,Depok,Male,34,1088,4,4352,2018-09-17 16:21:23.000000 UTC
4,456382,Ofline store,314798,Depok,Male,34,1088,4,4352,2018-10-31 18:20:07.000000 UTC
5,481999,Ofline store,294626,Bogor,Female,34,1088,4,4352,2018-11-05 11:29:14.000000 UTC

In [19]:
ds.tail(5)

,transaction_id,store,customer_id,customer_city,customer_gender,product_id,product_price,quantity,total,created_at
48568,463122,Online store,127691,Depok,Female,49,818,62,50716,2018-11-01 19:54:38+00:00
48569,527161,Online store,160838,Depok,Female,49,818,62,50716,2018-11-15 07:24:45+00:00
48570,775139,Online store,438662,Jakarta,Female,49,818,62,50716,2018-12-28 14:59:12+00:00
48571,750554,Online store,285030,Depok,Male,49,818,62,50716,2018-12-18 08:52:34+00:00
48572,638625,Online store,395567,Jakarta,Female,49,818,62,50716,2018-12-02 05:24:20+00:00

In [9]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48573 entries, 0 to 48572
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   transaction_id   48573 non-null  int64
 1   store            48573 non-null  object
 2   customer_id      48573 non-null  int64
 3   customer_city    48573 non-null  object
 4   customer_gender  48573 non-null  object
 5   product_id       48573 non-null  int64
 6   product_price    48573 non-null  int64
 7   quantity         48573 non-null  int64
 8   total            48573 non-null  int64
 9   created_at       48573 non-null  object
dtypes: int64(6), object(4)
memory usage: 3.7+ MB

In [16]:
ds['created_at'] = pd.to_datetime(ds['created_at'])

In [17]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 48573 entries, 0 to 48572
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   transaction_id   48573 non-null  int64
 1   store            48573 non-null  object
 2   customer_id      48573 non-null  int64
 3   customer_city    48573 non-null  object
 4   customer_gender  48573 non-null  object
 5   product_id       48573 non-null  int64
 6   product_price    48573 non-null  int64
 7   quantity         48573 non-null  int64
 8   total            48573 non-null  int64
 9   created_at       48573 non-null  datetime64[ns, UTC]
dtypes: datetime64[ns, UTC](1), int64(6), object(3)
memory usage: 3.7+ MB

In [8]:
ds.shape

(48573, 10)

In [10]:
ds.isnull().sum()

transaction_id     0
store              0
customer_id        0
customer_city      0
customer_gender    0
product_id         0
product_price      0
quantity           0
total              0
created_at         0
dtype: int64

In [23]:
ds_1 = ds[ds['customer_gender'].str.contains('Male')]
ds_1

,transaction_id,store,customer_id,customer_city,customer_gender,product_id,product_price,quantity,total,created_at
0,169483,Ofline store,300726,Jakarta,Male,34,1088,64,69632,2018-07-06 18:02:28+00:00
1,262286,Ofline store,186646,Tangerang,Male,34,1088,64,69632,2018-08-27 17:07:31+00:00
3,311059,Ofline store,190587,Depok,Male,34,1088,4,4352,2018-09-17 16:21:23+00:00
4,456382,Ofline store,314798,Depok,Male,34,1088,4,4352,2018-10-31 18:20:07+00:00
7,321799,Ofline store,141261,Depok,Male,39,1888,72,135936,2018-09-21 13:05:27+00:00
...,...,...,...,...,...,...,...,...,...,...
48563,440637,Online store,168345,Depok,Male,49,818,62,50716,2018-10-28 17:01:35+00:00
48565,755014,Online store,434618,Bogor,Male,49,818,62,50716,2018-12-20 07:15:10+00:00
48566,502922,Online store,145073,Jakarta,Male,49,818,62,50716,2018-11-09 19:24:41+00:00
48567,104282,Online store,231111,Depok,Male,49,818,62,50716,2018-05-20 01:30:00+00:00
48571,750554,Online store,285030,Depok,Male,49,818,62,50716,2018-12-18 08:52:34+00:00